In [1]:
import pandas as pd

## Series

* Series é um tipo de dado que tem um índice acompanhado de um valor

In [6]:
data = [2,4,6,8,10]

In [7]:
s_data = pd.Series(data)

In [8]:
s_data

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [9]:
index = ['Linha' + str(i) for i in range(5)]

In [10]:
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [11]:
s_data = pd.Series(data = data, index = index)

In [12]:
s_data

Linha0     2
Linha1     4
Linha2     6
Linha3     8
Linha4    10
dtype: int64

In [16]:
data = {'Linha' + str(i) : i + 2 for i in range(5)}

In [17]:
data

{'Linha0': 2, 'Linha1': 3, 'Linha2': 4, 'Linha3': 5, 'Linha4': 6}

In [18]:
s_data = pd.Series(data)
s_data

Linha0    2
Linha1    3
Linha2    4
Linha3    5
Linha4    6
dtype: int64

In [21]:
s1 = s_data + 2

In [22]:
s1

Linha0    0
Linha1    1
Linha2    0
Linha3    1
Linha4    0
dtype: int64

## DataFrames

In [43]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [44]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [45]:
df_data = pd.DataFrame(data)

In [46]:
df_data

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [47]:
index = ['Linha ' + str(i) for i in range(3)]
index

['Linha 0', 'Linha 1', 'Linha 2']

In [48]:
df_data = pd.DataFrame(data, index)
df_data

         0  1  2
Linha 0  1  2  3
Linha 1  4  5  6
Linha 2  7  8  9

In [49]:
columns = ['Coluna ' + str(i) for i in range(3)]
columns

['Coluna 0', 'Coluna 1', 'Coluna 2']

In [50]:
df_data = pd.DataFrame(data, index, columns)
df_data

         Coluna 0  Coluna 1  Coluna 2
Linha 0         1         2         3
Linha 1         4         5         6
Linha 2         7         8         9

In [37]:
data = {
    'column 0': {
        'linha 0': 1,
        'linha 1': 2,
        'linha 2': 3
    },
    'column 1': {
        'linha 0': 4,
        'linha 1': 5,
        'linha 2': 6
    },
    'column 2': {
        'linha 0': 7,
        'linha 1': 8,
        'linha 2': 9
    }
}

In [39]:
df_data = pd.DataFrame(data)
df_data

         column 0  column 1  column 2
linha 0         1         4         7
linha 1         2         5         8
linha 2         3         6         9

In [53]:
df1 = pd.DataFrame(data, index, columns)
df2 = pd.DataFrame(data, index, columns)
df3 = pd.DataFrame(data, index, columns)
df1[df1 > 0] = 'A'
df1

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A

In [54]:
df2[df2 > 0] = 'B'
df3[df3 > 0] = 'C'

In [55]:
df2

        Coluna 0 Coluna 1 Coluna 2
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B

In [56]:
df3

        Coluna 0 Coluna 1 Coluna 2
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [57]:
df4 = pd.concat([df1, df2, df3]) # concatena todos os data frames e os coloca em um mesmo data frame

In [58]:
df4

        Coluna 0 Coluna 1 Coluna 2
Linha 0        A        A        A
Linha 1        A        A        A
Linha 2        A        A        A
Linha 0        B        B        B
Linha 1        B        B        B
Linha 2        B        B        B
Linha 0        C        C        C
Linha 1        C        C        C
Linha 2        C        C        C

In [28]:
import pandas as pd
from datetime import datetime as dt

In [31]:
date_time = dt.now()
date_time

datetime.datetime(2023, 7, 29, 0, 5, 51, 378926)

In [33]:
day = date_time.day
month = date_time.month
year = date_time.year

hour = date_time.hour
minutes = date_time.minute
seconds = date_time.second

In [39]:
pressao = [
    {
        'DATE': f'{month}/{day}/{year}', 
        'HOUR': f'{hour}:{minutes}:{seconds}',
        'PRESSION': '120/80'
    }
]
pressao

[{'DATE': '7/29/2023', 'HOUR': '0:5:51', 'PRESSION': '120/80'}]

In [40]:
df_pressao = pd.DataFrame(pressao)

In [41]:
df_pressao

        DATE    HOUR PRESSION
0  7/29/2023  0:5:51   120/80